RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
/**
 *******************************************************************************
 * @file  hc32f4a0_nfc.c
 * @brief This file provides firmware functions to manage the EXMC NFC
 *        (External Memory Controller: NAND Flash Controller) driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Hongjh          First version
   2020-07-14       Hongjh          1. Merge API from EXMC_NFC_Enable/Disable to EXMC_NFC_Cmd
                                    2. Merge API from EXMC_NFC_Enable/DisableEcc
                                       to EXMC_NFC_EccCmd
                                    3. Merge API from EXMC_NFC_Enable/DisableWriteProtect
                                       to EXMC_NFC_WriteProtectCmd
   2020-08-25       Hongjh          Modify the pointer type cast
   2020-10-12       Hongjh          The function EXMC_NFC_ReadId add timeout
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_nfc.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EXMC_NFC EXMC_NFC
 * @brief NAND Flash Controller Driver Library
 * @{
 */

#if (DDL_NFC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EXMC_NFC_Local_Macros NAND Flash Controller Local Macros
 * @{
 */

/**
 * @defgroup EXMC_SMC_Check_Parameters_Validity EXMC SMC Check Parameters Validity
 * @{
 */

#define IS_EXMC_NFC_BANK(x)                                                    \
(   (EXMC_NFC_BANK_0 == (x))                    ||                             \
    (EXMC_NFC_BANK_1 == (x))                    ||                             \
    (EXMC_NFC_BANK_2 == (x))                    ||                             \
    (EXMC_NFC_BANK_3 == (x))                    ||                             \
    (EXMC_NFC_BANK_4 == (x))                    ||                             \
    (EXMC_NFC_BANK_5 == (x))                    ||                             \
    (EXMC_NFC_BANK_6 == (x))                    ||                             \
    (EXMC_NFC_BANK_7 == (x)))

#define IS_EXMC_NFC_MEM_WIDTH(x)                                               \
(   (EXMC_NFC_MEMORY_WIDTH_8BIT == (x))         ||                             \
    (EXMC_NFC_MEMORY_WIDTH_16BIT == (x)))

#define IS_EXMC_NFC_BANK_CAPACITY(x)                                           \
(   (EXMC_NFC_BANK_CAPACITY_512MBIT == (x))     ||                             \
    (EXMC_NFC_BANK_CAPACITY_1GBIT == (x))       ||                             \
    (EXMC_NFC_BANK_CAPACITY_2GBIT == (x))       ||                             \
    (EXMC_NFC_BANK_CAPACITY_4GBIT == (x))       ||                             \
    (EXMC_NFC_BANK_CAPACITY_8GBIT == (x))       ||                             \
    (EXMC_NFC_BANK_CAPACITY_16GBIT == (x))      ||                             \
    (EXMC_NFC_BANK_CAPACITY_32GBIT == (x))      ||                             \
    (EXMC_NFC_BANK_CAPACITY_64GBIT == (x)))

#define IS_EXMC_NFC_PAGE_SIZE(x)                                               \
(   (EXMC_NFC_PAGE_SIZE_2KBYTES == (x))         ||                             \
    (EXMC_NFC_PAGE_SIZE_4KBYTES == (x))         ||                             \
    (EXMC_NFC_PAGE_SIZE_8KBYTES == (x)))

#define IS_EXMC_NFC_BANK_NUM(x)                                                \
(   (EXMC_NFC_1_BANK == (x))                    ||                             \
    (EXMC_NFC_2_BANKS == (x))                   ||                             \
    (EXMC_NFC_4_BANKS == (x))                   ||                             \
    (EXMC_NFC_8_BANKS == (x)))

#define IS_EXMC_NFC_WR_PROTECT(x)                                              \
(   (EXMC_NFC_WR_PROTECT_ENABLE == (x))         ||                             \
    (EXMC_NFC_WR_PROTECT_DISABLE == (x)))

#define IS_EXMC_NFC_ECC_MODE(x)                                                \
(   (EXMC_NFC_ECC_1BIT == (x))                  ||                             \
    (EXMC_NFC_ECC_4BITS == (x)))

#define IS_EXMC_NFC_ROW_ADDRESS_CYCLES(x)                                      \
(   (EXMC_NFC_2_ROW_ADDRESS_CYCLES == (x))      ||                             \
    (EXMC_NFC_3_ROW_ADDRESS_CYCLES == (x)))

#define IS_EXMC_NFC_SECTION(x)                  ((x) <= EXMC_NFC_ECC_SECTION15)

#define IS_EXMC_NFC_INT(x)                                                     \
(   (0UL != (x))                                 &&                            \
    (0UL == ((x) & (~EXMC_NFC_INT_MASK))))


#define IS_EXMC_NFC_FLAG(x)                                                    \
(   (0UL != (x))                                 &&                            \
    (0UL == ((x) & (~EXMC_NFC_FLAG_MASK))))

#define IS_EXMC_NFC_COLUMN(x)                   ((x) <= NFC_COLUMN_MAX)

#define IS_EXMC_NFC_PAGE(page, capacity_index)  ((page) <= NFC_PAGE_MAX((capacity_index)))

#define IS_EXMC_NFC_TIMING_TS(x)                ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWP(x)               ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRP(x)               ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TH(x)                ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWH(x)               ((x) <= 0xFFUL)

