RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
#define IS_EXMC_NFC_TIMING_TRH(x)               ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRR(x)               ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWB(x)               ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TCCS(x)              ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TWTR(x)              ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TRTW(x)              ((x) <= 0xFFUL)

#define IS_EXMC_NFC_TIMING_TADL(x)              ((x) <= 0xFFUL)
/**
 * @}
 */

/**
 * @defgroup NFC flag mask
 * @{
 */
#define EXMC_NFC_INT_MASK                                                      \
(   EXMC_NFC_INT_RB_BANK0                       |                              \
    EXMC_NFC_INT_RB_BANK1                       |                              \
    EXMC_NFC_INT_RB_BANK2                       |                              \
    EXMC_NFC_INT_RB_BANK3                       |                              \
    EXMC_NFC_INT_RB_BANK4                       |                              \
    EXMC_NFC_INT_RB_BANK5                       |                              \
    EXMC_NFC_INT_RB_BANK6                       |                              \
    EXMC_NFC_INT_RB_BANK7                       |                              \
    EXMC_NFC_INT_ECC_ERROR                      |                              \
    EXMC_NFC_INT_ECC_CALC_COMPLETION            |                              \
    EXMC_NFC_INT_ECC_CORRECTABLE_ERROR          |                              \
    EXMC_NFC_INT_ECC_UNCORRECTABLE_ERROR)
/**
 * @}
 */

/**
 * @defgroup NFC flag mask
 * @{
 */
#define EXMC_NFC_FLAG_MASK                                                     \
(   EXMC_NFC_FLAG_RB_BANK0                      |                              \
    EXMC_NFC_FLAG_RB_BANK1                      |                              \
    EXMC_NFC_FLAG_RB_BANK2                      |                              \
    EXMC_NFC_FLAG_RB_BANK3                      |                              \
    EXMC_NFC_FLAG_RB_BANK4                      |                              \
    EXMC_NFC_FLAG_RB_BANK5                      |                              \
    EXMC_NFC_FLAG_RB_BANK6                      |                              \
    EXMC_NFC_FLAG_RB_BANK7                      |                              \
    EXMC_NFC_FLAG_ECC_ERROR                     |                              \
    EXMC_NFC_FLAG_ECC_CALCULATING               |                              \
    EXMC_NFC_FLAG_ECC_CALC_COMPLETION           |                              \
    EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR         |                              \
    EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR)
/**
 * @}
 */

/**
 * @defgroup NFC_Memory_Capacity_Index NFC Memory Capacity Index
 * @{
 */
#define NFC_CAPACITY_INDEX_512MBIT              (0UL)
#define NFC_CAPACITY_INDEX_1GBIT                (1UL)
#define NFC_CAPACITY_INDEX_2GBIT                (2UL)
#define NFC_CAPACITY_INDEX_4GBIT                (3UL)
#define NFC_CAPACITY_INDEX_8GBIT                (4UL)
#define NFC_CAPACITY_INDEX_16GBIT               (5UL)
#define NFC_CAPACITY_INDEX_32GBIT               (6UL)
#define NFC_CAPACITY_INDEX_64GBIT               (7UL)
/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Command_Regster_Value EXMC NFC Command Regster Value
 * @{
 */
/*!< Command value */
#define NFC_CMD_VALUE(arg, bank, cmd)           ((arg) | ((bank) << 8UL) | (cmd))

/*!< Command: Read status */
#define NFC_ADDR_VALUE(bank, addr)              (0x40000000UL | ((bank) << 8UL) | (addr))

/*!< Command: Read status */
#define CMD_RESET(bank)                         (NFC_CMD_VALUE(0UL, (bank), EXMC_NFC_CMD_RESET))

/*!< Command: Read status */
#define CMD_ASYNC_RESET(bank)                   (NFC_CMD_VALUE(0x82000000UL, (bank), EXMC_NFC_CMD_ASYNCHRONOUS_RESSET))

/*!< Command: Read status */
#define CMD_RESET_LUN(bank)                     (NFC_CMD_VALUE(0x82000000UL, (bank), EXMC_NFC_CMD_RESET_LUN))

/*!< Command: Read status */
#define CMD_READ_STATUS(bank)                   (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_READ_STATUS))

/*!< Command: Read status */
#define CMD_READ_STATUS_ENHANCED(bank)          (NFC_CMD_VALUE(0x80000000UL, (bank), EXMC_NFC_CMD_READ_STATUS_ENHANCED))

/*!< Command: Read ID */
#define CMD_READ_ID(bank)                       (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_READ_ID))
#define CMD_READ_ID_ADDR(bank, addr)            (NFC_ADDR_VALUE((bank), (addr)))

/*!< Command: Read unique ID */
#define CMD_READ_UNIQUEID(bank)                 (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_READ_UNIQUE_ID))
#define CMD_READ_UNIQUEID_ADDR(bank)            (NFC_ADDR_VALUE((bank), 0UL))

/*!< Command: Erase block */
#define CMD_ERASE_BLOCK_1ST_CYCLE(bank)         (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_BLK_ERASE_1ST))
#define CMD_ERASE_BLOCK_2ND_CYCLE(bank)         (NFC_CMD_VALUE(0x81000000UL, (bank), EXMC_NFC_CMD_BLK_ERASE_2ND))

/*!< Command: Read parameter page */
#define CMD_READ_PARAMETER_PAGE(bank)           (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_READ_PARAMETER_PAGE))
#define CMD_READ_PARAMETER_PAGE_ADDR(bank)      (NFC_ADDR_VALUE((bank), 0UL))

/*!< Command: Set feature */
#define CMD_SET_FEATURE(bank)                   (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_SET_FEATURES))
#define CMD_SET_FEATURE_ADDR(bank, addr)        (NFC_ADDR_VALUE((bank), (addr)))

/*!< Command: Get feature */
#define CMD_GET_FEATURE(bank)                   (NFC_CMD_VALUE(0x83000000UL, (bank), EXMC_NFC_CMD_GET_FEATURES))
#define CMD_GET_FEATURE_ADDR(bank, addr)        (NFC_ADDR_VALUE((bank), (addr)))

/*!< Command: Address cycle */
#define CMD_ADDR_1ST_CYCLE(bank, ras)           (NFC_ADDR_VALUE((bank), ((ras) & 0xFFUL)))
#define CMD_ADDR_2ND_CYCLE(bank, ras)           (NFC_ADDR_VALUE((bank), (((ras) & 0xFF00UL) >> 8UL)))
#define CMD_ADDR_3RD_CYCLE(bank, ras)           (NFC_ADDR_VALUE((bank), (((ras) & 0xFF0000UL) >> 16UL)))

/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_IDXR_Bit_Position EXMC NFC IDXR Bit Position
 * @{
 */
#define EXMC_NFC_IDXR_COL_POS                   (0UL)
#define EXMC_NFC_IDXR_2KPAGE_POS                (12UL)
#define EXMC_NFC_IDXR_512MBIT_BANK_POS          (27UL)
/**
 * @}
 */

/*!< NFC BACR regsiter: page field value */
#define NFC_BACR_PAGE_VAL                       ((READ_REG32_BIT(M4_NFC->BACR, NFC_BACR_PAGE) >> NFC_BACR_PAGE_POS))

/*!< NFC Page Size */
#define NFC_PAGE_SIZE                           (1024UL << (NFC_BACR_PAGE_VAL & 0x3UL))

/*!< NFC Spare Size for user data */
#define NFC_SPARE_SIZE_FOR_USER_DATA            ((READ_REG32_BIT(M4_NFC->BACR, NFC_BACR_SCS) >> NFC_BACR_SCS_POS) << 2UL)

/*!< IDX register mask for 64bit */
#define NFC_IDXR_MASK                           (0x1FFFFFFFFFULL)

/*!< NFC_ISTR register RBST bit mask */
#define NFC_FLAG_RB_BANKx_MASK(bank)            (EXMC_NFC_FLAG_RB_BANK0 << (EXMC_NFC_BANK_7 & (bank)))

/*!< IDX register mask for 64bit */
#define NFC_NFC_ISTR_MASK                       (0xFF53UL)

/*!< NFC_DATR for 32bit */
#define NFC_DATR_REG32(x)                       (M4_NFC->DATR_BASE)

/*!< NFC_ID_DATR for 32bit */
#define NFC_ID_REG32(x)                         (*((__IO uint32_t *)((uint32_t)(&(M4_NFC->DATR_BASE)) + 0x8010UL + ((x) << 2UL))))

/*!< NFC_SYND_REG for 32bit */
#define NFC_SYND_REG32(sect, reg)               (*((__IO uint32_t *)((uint32_t)(&(M4_NFC->ECC_SYND0_0)) + (((uint32_t)(sect)) << 4UL) + (((uint32_t)(reg)) << 2UL))))

/*!< NFC_ECCR_REG for 32bit */
#define NFC_ECCR_REG32(sect)                    (*((__IO uint32_t *)((uint32_t)(&(M4_NFC->ECCR0))   + (((uint32_t)(sect)) << 2UL))))

/*!< NFC_SYND_MAX_Length (Unit: half-word ) */
#define NFC_SYND_MAX_LEN                        (8U)

/**
 * @defgroup Parameter_Align Parameter Align
 * @{
 */
#define IS_PARAM_ALIGN_WORD(x)                  (IS_ADDRESS_ALIGN_WORD((x)))
/**
 * @}
 */

/*!< NFC column max */
#define NFC_COLUMN_MAX                          ((1UL << (12UL + ((0x03UL & NFC_BACR_PAGE_VAL) - 1UL))) - 1UL)

/*!< NFC page max for the specified capacity */
#define NFC_PAGE_MAX(capacity_index)            ((1UL << (14UL + capacity_index - ((0x03UL & NFC_BACR_PAGE_VAL) - 1UL))) - 1UL)

/**
 * @brief  Calculate NFC_IDXR register(64bits) value.
 * @param  [in]bank             The specified bank
 *   @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *   @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *   @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *   @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *   @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *   @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *   @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *   @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in]page             The page address
 * @param  [in]col              The column address
 * @param  [in]capacity_index   The number of bank capacity bits
 *   @arg NFC_CAPACITY_INDEX_512MBIT: NFC device bank size:512M bits
 *   @arg NFC_CAPACITY_INDEX_1GBIT: NFC device bank size:1G bits
 *   @arg NFC_CAPACITY_INDEX_2GBIT: NFC device bank size:2G bits
 *   @arg NFC_CAPACITY_INDEX_4GBIT: NFC device bank size:4G bits
 *   @arg NFC_CAPACITY_INDEX_8GBIT: NFC device bank size:8G bits
 *   @arg NFC_CAPACITY_INDEX_16GBIT: NFC device bank size:16G bits
 *   @arg NFC_CAPACITY_INDEX_32BIT: NFC device bank size:32G bits
 *   @arg NFC_CAPACITY_INDEX_64BIT: NFC device bank size:64G bits
 * @retval NFC Index value
 */
#define NFC_IDXR_VAL(bank, page, col, capacity_index)                          \
(   (((uint64_t)(col)) << EXMC_NFC_IDXR_COL_POS)     |                         \
    (((uint64_t)(page)) << (EXMC_NFC_IDXR_2KPAGE_POS + ((0x03UL & NFC_BACR_PAGE_VAL) - 1UL))) | \
    (((uint64_t)(bank)) << (EXMC_NFC_IDXR_512MBIT_BANK_POS + (0x07UL & (capacity_index)))))
/**
 * @}
 */

