RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/**
 * @addtogroup EXMC_NFC_Local_Functions
 * @{
 */

static en_result_t EXMC_NFC_Read(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    uint32_t u32Col,
                                    uint32_t au32Data[],
                                    uint32_t u32NumWords,
                                    en_functional_state_t enEccState,
                                    uint32_t u32Timeout);
static en_result_t EXMC_NFC_Write(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    uint32_t u32Col,
                                    const uint32_t au32Data[],
                                    uint32_t u32NumWords,
                                    en_functional_state_t enEccState,
                                    uint32_t u32Timeout);
static uint32_t EXMC_NFC_GetCapacityIndex(void);
static en_result_t EXMC_NFC_WaitFlagUntilTo(uint32_t u32Flag,
                                                    en_flag_status_t enStatus,
                                                    uint32_t u32Timeout);

/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EXMC_NFC_Global_Functions NAND Flash Controller Global Functions
 * @{
 */

/**
 * @brief  Initialize EXMC NFC function.
 * @param  [in] pstcInit                Pointer to a @ref stc_exmc_nfc_init_t structure (EXMC NFC function configuration structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EXMC_NFC_Init(const stc_exmc_nfc_init_t *pstcInit)
{
    uint32_t u32RegVal;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check the pointer pstcInit */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_CAPACITY(pstcInit->stcBaseCfg.u32CapacitySize));
        DDL_ASSERT(IS_EXMC_NFC_MEM_WIDTH(pstcInit->stcBaseCfg.u32MemWidth));
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(pstcInit->stcBaseCfg.u32BankNum));
        DDL_ASSERT(IS_EXMC_NFC_PAGE_SIZE(pstcInit->stcBaseCfg.u32PageSize));
        DDL_ASSERT(IS_EXMC_NFC_WR_PROTECT(pstcInit->stcBaseCfg.u32WrProtect));
        DDL_ASSERT(IS_EXMC_NFC_ECC_MODE(pstcInit->stcBaseCfg.u32EccMode));
        DDL_ASSERT(IS_EXMC_NFC_ROW_ADDRESS_CYCLES(pstcInit->stcBaseCfg.u32RowAddrCycle));

        DDL_ASSERT(IS_EXMC_NFC_TIMING_TS(pstcInit->stcTimingReg0.u32TS));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWP(pstcInit->stcTimingReg0.u32TWP));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRP(pstcInit->stcTimingReg0.u32TRP));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TH(pstcInit->stcTimingReg0.u32TH));

        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWH(pstcInit->stcTimingReg1.u32TWH));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRH(pstcInit->stcTimingReg1.u32TRH));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRR(pstcInit->stcTimingReg1.u32TRR));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWB(pstcInit->stcTimingReg1.u32TWB));

        DDL_ASSERT(IS_EXMC_NFC_TIMING_TCCS(pstcInit->stcTimingReg2.u32TCCS));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TWTR(pstcInit->stcTimingReg2.u32TWTR));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TRTW(pstcInit->stcTimingReg2.u32TRTW));
        DDL_ASSERT(IS_EXMC_NFC_TIMING_TADL(pstcInit->stcTimingReg2.u32TADL));

        /* Set NFC open-page.*/
        WRITE_REG32(M4_PERIC->NFC_SYCTLREG, pstcInit->u32OpenPage);

        /* Disable hardware ECC.*/
        WRITE_REG32(M4_NFC->IENR, 0x00000080UL);

        /* Clear flag.*/
        WRITE_REG32(M4_NFC->ISTR, 0x00000000UL);

        /* Set NFC base configure.*/
        u32RegVal = (pstcInit->stcBaseCfg.u32CapacitySize | \
                     pstcInit->stcBaseCfg.u32MemWidth | \
                     pstcInit->stcBaseCfg.u32BankNum | \
                     pstcInit->stcBaseCfg.u32PageSize | \
                     pstcInit->stcBaseCfg.u32WrProtect | \
                     pstcInit->stcBaseCfg.u32EccMode | \
                     pstcInit->stcBaseCfg.u32RowAddrCycle | \
                     (((uint32_t)pstcInit->stcBaseCfg.u8SpareSizeForUserData) << NFC_BACR_SCS_POS));
        WRITE_REG32(M4_NFC->BACR, u32RegVal);

        /* Set NFC timing register 0.*/
        u32RegVal = ((pstcInit->stcTimingReg0.u32TS << NFC_TMCR0_TS_POS)   | \
                     (pstcInit->stcTimingReg0.u32TWP << NFC_TMCR0_TWP_POS) | \
                     (pstcInit->stcTimingReg0.u32TRP << NFC_TMCR0_TRP_POS) | \
                     (pstcInit->stcTimingReg0.u32TH << NFC_TMCR0_TH_POS));
        WRITE_REG32(M4_NFC->TMCR0, u32RegVal);

        /* Set NFC timing register 1.*/
        u32RegVal = ((pstcInit->stcTimingReg1.u32TWH << NFC_TMCR1_TWH_POS) | \
                     (pstcInit->stcTimingReg1.u32TRH << NFC_TMCR1_TRH_POS) | \
                     (pstcInit->stcTimingReg1.u32TRR << NFC_TMCR1_TRR_POS) | \
                     (pstcInit->stcTimingReg1.u32TWB << NFC_TMCR1_TWB_POS));
        WRITE_REG32(M4_NFC->TMCR1, u32RegVal);

        /* Set NFC timing register 2.*/
        u32RegVal = ((pstcInit->stcTimingReg2.u32TCCS << NFC_TMCR2_TCCS_POS) | \
                     (pstcInit->stcTimingReg2.u32TWTR << NFC_TMCR2_TWTR_POS) | \
                     (pstcInit->stcTimingReg2.u32TRTW << NFC_TMCR2_TRTW_POS) | \
                     (pstcInit->stcTimingReg2.u32TADL << NFC_TMCR2_TADL_POS));
        WRITE_REG32(M4_NFC->TMCR2, u32RegVal);

        /* De-select NFC bank */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_DESELECT_CHIP);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize EXMC NFC function.
 * @param  None
 * @retval None
 */
void EXMC_NFC_DeInit(void)
{
    WRITE_REG32(M4_NFC->BACR, 0x00002187UL);
    WRITE_REG32(M4_NFC->IENR, 0x00000080UL);
    WRITE_REG32(M4_NFC->ISTR, 0x00000000UL);
    WRITE_REG32(M4_NFC->TMCR0, 0x03030202UL);
    WRITE_REG32(M4_NFC->TMCR1, 0x28080303UL);
    WRITE_REG32(M4_NFC->TMCR2, 0x03050D03UL);
}

/**
 * @brief  Set the fields of structure stc_exmc_nfc_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_exmc_nfc_init_t structure (EXMC NFC function configuration structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t EXMC_NFC_StructInit(stc_exmc_nfc_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != pstcInit)
    {
        pstcInit->stcBaseCfg.u32CapacitySize = EXMC_NFC_BANK_CAPACITY_8GBIT;
        pstcInit->stcBaseCfg.u32MemWidth = EXMC_NFC_MEMORY_WIDTH_8BIT;
        pstcInit->stcBaseCfg.u32BankNum = EXMC_NFC_4_BANKS;
        pstcInit->stcBaseCfg.u32PageSize = EXMC_NFC_PAGE_SIZE_2KBYTES;
        pstcInit->stcBaseCfg.u32WrProtect = EXMC_NFC_WR_PROTECT_ENABLE;
        pstcInit->stcBaseCfg.u32EccMode = EXMC_NFC_ECC_1BIT;
        pstcInit->stcBaseCfg.u32RowAddrCycle = EXMC_NFC_3_ROW_ADDRESS_CYCLES;
        pstcInit->stcBaseCfg.u8SpareSizeForUserData = 0U;

        pstcInit->stcTimingReg0.u32TS = 0x02UL;
        pstcInit->stcTimingReg0.u32TWP = 0x02UL;
        pstcInit->stcTimingReg0.u32TRP = 0x03UL;
        pstcInit->stcTimingReg0.u32TH = 0x03UL;

        pstcInit->stcTimingReg1.u32TWH = 0x03UL;
        pstcInit->stcTimingReg1.u32TRH = 0x03UL;
        pstcInit->stcTimingReg1.u32TRR = 0x02UL;
        pstcInit->stcTimingReg1.u32TWB = 0x28UL;

