RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
        pstcInit->stcTimingReg2.u32TCCS = 0x03UL;
        pstcInit->stcTimingReg2.u32TWTR = 0x0DUL;
        pstcInit->stcTimingReg2.u32TRTW = 0x05UL;
        pstcInit->stcTimingReg2.u32TADL = 0x03UL;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable/disable NFC.
 * @param  [in]  enNewState                 An en_functional_state_t enumeration value.
 *         This parameter can be one of the following values:
 *           @arg Enable:                   Enable function.
 *           @arg Disable:                  Disable function.
 * @retval None
 */
void EXMC_NFC_Cmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bM4_PERIC->EXMC_ENAR_b.NFCEN, enNewState);
}

/**
 * @brief  Enable/disable NFC ECC function.
 * @param  [in]  enNewState                 An en_functional_state_t enumeration value.
 *         This parameter can be one of the following values:
 *           @arg Enable:                   Enable function.
 *           @arg Disable:                  Disable function.
 * @retval None
 */
void EXMC_NFC_EccCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        CLEAR_REG32_BIT(M4_NFC->IENR, NFC_IENR_ECCDIS);
    }
    else
    {
        SET_REG32_BIT(M4_NFC->IENR, NFC_IENR_ECCDIS);
    }
}

/**
 * @brief  Enable/disable NFC write protection function.
 * @param  [in]  enNewState                 An en_functional_state_t enumeration value.
 *         This parameter can be one of the following values:
 *           @arg Enable:                   Enable function.
 *           @arg Disable:                  Disable function.
 * @retval None
 */
void EXMC_NFC_WriteProtectCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        CLEAR_REG32_BIT(M4_NFC->BACR, NFC_BACR_WP);
    }
    else
    {
        SET_REG32_BIT(M4_NFC->BACR, NFC_BACR_WP);
    }
}

/**
 * @brief  Enable or disable the specified NFC interrupt
 * @param  [in] u16IntSource            The specified interrupt
 *         This parameter can be any composed value of the following values:
 *           @arg EXMC_NFC_INT_ECC_UNCORRECTABLE_ERROR: ECC uncorrectable error interrupt
 *           @arg EXMC_NFC_INT_ECC_CORRECTABLE_ERROR: ECC correctable error interrupt
 *           @arg EXMC_NFC_INT_ECC_CALC_COMPLETION: Calculating ECC completely interrupt
 *           @arg EXMC_NFC_INT_ECC_ERROR: ECC error interrupt
 *           @arg EXMC_NFC_INT_RB_BANK0: NFC bank 0 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK1: NFC bank 1 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK2: NFC bank 2 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK3: NFC bank 3 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK4: NFC bank 4 device ready flag
 *           @arg EXMC_NFC_INT_RB_BANK5: NFC bank 5 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK6: NFC bank 6 device ready interrupt
 *           @arg EXMC_NFC_INT_RB_BANK7: NFC bank 7 device ready interrupt
 * @param  [in] enNewState              The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void EXMC_NFC_IntCmd(uint16_t u16IntSource, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_EXMC_NFC_INT(u16IntSource));

    if (Enable == enNewState)
    {
        SET_REG16_BIT(M4_NFC->IENR, u16IntSource);
    }
    else
    {
        CLEAR_REG16_BIT(M4_NFC->IENR, u16IntSource);
    }
}

/**
 * @brief  Get the flag.
 * @param  [in] u32Flag                 The specified flag
 *         This parameter can be any composed value of the following values:
 *           @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR: ECC uncorrectable error
 *           @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR: ECC correctable error
 *           @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculate ECC completely
 *           @arg EXMC_NFC_FLAG_ECC_ERROR: ECC error
 *           @arg EXMC_NFC_FLAG_RB_BANK0: NFC bank 0 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK1: NFC bank 1 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK2: NFC bank 2 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK3: NFC bank 3 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK4: NFC bank 4 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK5: NFC bank 5 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK6: NFC bank 6 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK7: NFC bank 7 device ready flag
 *           @arg EXMC_NFC_FLAG_ECC_CALCULATING: Calculating ECC
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t EXMC_NFC_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enStatus1 = Set;
    en_flag_status_t enStatus2 = Set;

    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

    if ((u32Flag & NFC_NFC_ISTR_MASK) != 0UL)
    {
        if (0UL == READ_REG32_BIT(M4_NFC->ISTR, (u32Flag & NFC_NFC_ISTR_MASK)))
        {
            enStatus1 = Reset;
        }
    }

    if ((u32Flag & EXMC_NFC_FLAG_ECC_CALCULATING) != 0UL)
    {
        if (0UL == READ_REG32(bM4_PERIC->NFC_SYSTATREG_b.PECC))
        {
            enStatus2 = Reset;
        }
    }

    return (((Set == enStatus1) && (Set == enStatus2)) ? Set : Reset);
}

/**
 * @brief  Get the flag.
 * @param  [in] u32Flag                 The specified flag
 *         This parameter can be any composed value of the following values:
 *           @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR: ECC uncorrectable error
 *           @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR: ECC correctable error
 *           @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculating ECC completely
 *           @arg EXMC_NFC_FLAG_ECC_ERROR: ECC error
 *           @arg EXMC_NFC_FLAG_RB_BANK0: NFC bank 0 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK1: NFC bank 1 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK2: NFC bank 2 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK3: NFC bank 3 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK4: NFC bank 4 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK5: NFC bank 5 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK6: NFC bank 6 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK7: NFC bank 7 device ready flag
 * @retval None
 */
void EXMC_NFC_ClearStatus(uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

    CLEAR_REG32_BIT(M4_NFC->ISTR, u32Flag);
}

/**
 * @brief  Get the interrupt result.
 * @param  [in] u32Flag                 The specified flag
 *         This parameter can be any composed value of the following values:
 *           @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR: ECC uncorrectable error
 *           @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR: ECC correctable error
 *           @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculating ECC completely
 *           @arg EXMC_NFC_FLAG_ECC_ERROR: ECC error
 *           @arg EXMC_NFC_FLAG_RB_BANK0: NFC bank 0 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK1: NFC bank 1 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK2: NFC bank 2 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK3: NFC bank 3 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK4: NFC bank 4 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK5: NFC bank 5 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK6: NFC bank 6 device ready flag
 *           @arg EXMC_NFC_FLAG_RB_BANK7: NFC bank 7 device ready flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t EXMC_NFC_GetIntResultStatus(uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

