RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
    return (READ_REG32_BIT(M4_NFC->IRSR, u32Flag) ? Set : Reset);
}

/**
 * @brief  Get the 1BIT ECC result of the specified section.
 * @param  [in] u32Section              The specified section
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_ECC_SECTION0: ECC section 0
 *           @arg EXMC_NFC_ECC_SECTION1: ECC section 1
 *           @arg EXMC_NFC_ECC_SECTION2: ECC section 2
 *           @arg EXMC_NFC_ECC_SECTION3: ECC section 3
 *           @arg EXMC_NFC_ECC_SECTION4: ECC section 4
 *           @arg EXMC_NFC_ECC_SECTION5: ECC section 5
 *           @arg EXMC_NFC_ECC_SECTION6: ECC section 6
 *           @arg EXMC_NFC_ECC_SECTION7: ECC section 7
 *           @arg EXMC_NFC_ECC_SECTION8: ECC section 8
 *           @arg EXMC_NFC_ECC_SECTION9: ECC section 9
 *           @arg EXMC_NFC_ECC_SECTION10: ECC section 10
 *           @arg EXMC_NFC_ECC_SECTION11: ECC section 11
 *           @arg EXMC_NFC_ECC_SECTION12: ECC section 12
 *           @arg EXMC_NFC_ECC_SECTION13: ECC section 13
 *           @arg EXMC_NFC_ECC_SECTION14: ECC section 14
 *           @arg EXMC_NFC_ECC_SECTION15: ECC section 15
 * @retval The register value
 */
uint32_t EXMC_NFC_GetEcc1BitResult(uint32_t u32Section)
{
    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_SECTION(u32Section));

    return READ_REG32(NFC_ECCR_REG32(u32Section));
}

/**
 * @brief  Set NFC spare area size.
 * @param  [in] u8SpareSizeForUserData      NFC spare area size for user data
 * @retval None
 */
void EXMC_NFC_SetSpareAreaSize(uint8_t u8SpareSizeForUserData)
{
    MODIFY_REG32(M4_NFC ->BACR, NFC_BACR_SCS, ((((uint32_t)u8SpareSizeForUserData) << NFC_BACR_SCS_POS) & NFC_BACR_SCS));
}

/**
 * @brief  Set NFC ECC mode.
 * @param  [in] u32EccMode              ECC mode
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_ECC_1BIT: ECC 1 bit
 *           @arg EXMC_NFC_ECC_4BITS: ECC 4 bits
 * @retval None
 */
void EXMC_NFC_SetEccMode(uint32_t u32EccMode)
{
    DDL_ASSERT(IS_EXMC_NFC_ECC_MODE(u32EccMode));

    MODIFY_REG32(M4_NFC ->BACR, NFC_BACR_ECCM, u32EccMode);
}

/**
 * @brief  Get the 4 bits ECC syndrome register value.
 * @param  [in] u32Section          The syndrome section
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_SYND0: ECC syndrome section 0
 *           @arg EXMC_NFC_SYND1: ECC syndrome section 1
 *           @arg EXMC_NFC_SYND2: ECC syndrome section 2
 *           @arg EXMC_NFC_SYND3: ECC syndrome section 3
 *           @arg EXMC_NFC_SYND4: ECC syndrome section 4
 *           @arg EXMC_NFC_SYND5: ECC syndrome section 5
 *           @arg EXMC_NFC_SYND6: ECC syndrome section 6
 *           @arg EXMC_NFC_SYND7: ECC syndrome section 7
 *           @arg EXMC_NFC_SYND8: ECC syndrome section 8
 *           @arg EXMC_NFC_SYND9: ECC syndrome section 9
 *           @arg EXMC_NFC_SYND10: ECC syndrome section 10
 *           @arg EXMC_NFC_SYND11: ECC syndrome section 11
 *           @arg EXMC_NFC_SYND12: ECC syndrome section 12
 *           @arg EXMC_NFC_SYND13: ECC syndrome section 13
 *           @arg EXMC_NFC_SYND14: ECC syndrome section 14
 *           @arg EXMC_NFC_SYND15: ECC syndrome section 15
 * @param  [out] au16Synd       The syndrome value
 * @param  [in] u8Length        The length to be read(unit: half-word)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: au16Synd = NULL or u8Length is out of range
 * @note  u8Length value don't be greater than 8
 */
en_result_t EXMC_NFC_GetSyndrome(uint32_t u32Section,
                                        uint16_t au16Synd[],
                                        uint8_t u8Length)
{
    uint8_t i;
    uint32_t u32SyndVal;
    uint8_t u8LoopWords;
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != au16Synd) && (u8Length <= NFC_SYND_MAX_LEN))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_SECTION(u32Section));

        u8LoopWords = (u8Length >> 1U);

        for (i = 0U; i < u8LoopWords; i++)
        {
            u32SyndVal = READ_REG32(NFC_SYND_REG32(u32Section, i));
            RW_MEM16(&au16Synd[i * 2U]) = (uint16_t)(u32SyndVal);
            RW_MEM16(&au16Synd[i * 2U + 1U ]) = (uint16_t)(u32SyndVal >> 16UL);
        }

        if ((u8Length % 2U) != 0U)
        {
            u32SyndVal = READ_REG32(NFC_SYND_REG32(u32Section, i));
            RW_MEM16(&au16Synd[i * 2U]) = (uint16_t)(u32SyndVal);
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Read NFC device status
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @retval NFC device status
 */
uint32_t EXMC_NFC_ReadStatus(uint32_t u32Bank)
{
    uint32_t u32Status;

    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

    /* Write 0x81000M70 to NFC_CMDR, M = bank number */
    WRITE_REG32(M4_NFC->CMDR, CMD_READ_STATUS(u32Bank));

    u32Status = READ_REG32(M4_NFC->DATR_BASE);

    EXMC_NFC_DeselectChip();

    return u32Status;
}

/**
 * @brief  Read status enhanced
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32RowAddress           The row address
 * @retval NFC device status enhanced
 */
uint32_t EXMC_NFC_ReadStatusEnhanced(uint32_t u32Bank,
                                            uint32_t u32RowAddress)
{
    uint32_t u32Status;

    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

    /* Erase block step:
        1. Write 0x81000M78 to NFC_CMDR, M = bank number
        2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the lowest bytes of Row address
        3. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the middle bytes of Row address
        4. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the highest bytes of Row address
        5. Read Data Register */
    WRITE_REG32(M4_NFC->CMDR, CMD_READ_STATUS_ENHANCED(u32Bank));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_1ST_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_2ND_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_3RD_CYCLE(u32Bank, u32RowAddress));

    u32Status = READ_REG32(M4_NFC->DATR_BASE);

    EXMC_NFC_DeselectChip();

    return u32Status;
}

/**
 * @brief  Reset NFC device
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Reset timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_Reset(uint32_t u32Bank, uint32_t u32Timeout)
{
    en_result_t enRet;

    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

    /* Clear Flag */
    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Reset step:
        1. Write 0x00000MFF to NFC_CMDR, M = bank number
        2. Wait RB signal until high level */
    WRITE_REG32(M4_NFC->CMDR, CMD_RESET(u32Bank));

    enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                     Set, \
                                     u32Timeout);

    EXMC_NFC_DeselectChip();

    return enRet;
}

/**
 * @brief  Asynchronous reset
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Reset timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_AsyncReset(uint32_t u32Bank, uint32_t u32Timeout)
{
    en_result_t enRet;

    /* Clear Flag */
    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Reset step:
        1. Write 0x00000MFC to NFC_CMDR, M = bank number
        2. Wait RB signal until high level */
    WRITE_REG32(M4_NFC->CMDR, CMD_ASYNC_RESET(u32Bank));

    enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                     Set, \
                                     u32Timeout);
    EXMC_NFC_DeselectChip();
    return enRet;
}

/**
 * @brief  Reset lun of NFC device
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32RowAddress           The row address
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Reset timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_ResetLun(uint32_t u32Bank,
                                    uint32_t u32RowAddress,
                                    uint32_t u32Timeout)
{
    en_result_t enRet;

    /* Clear Flag */
    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Reset lun step:
        1. Write 0x82000MFA to NFC_CMDR, M = bank number
        2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the lowest bytes of Row address
        3. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the middle bytes of Row address
        4. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the highest bytes of Row address
        5. Wait RB signal until high level */
    WRITE_REG32(M4_NFC->CMDR, CMD_RESET_LUN(u32Bank));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_1ST_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_2ND_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_3RD_CYCLE(u32Bank, u32RowAddress));

    enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                     Set, \
                                     u32Timeout);
    return enRet;
}

/**
 * @brief  Read ID
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32IdAddr               The address
 * @param  [in] au8DevId                The id buffer
 * @param  [in] u32NumBytes             The number of bytes to read
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  Error:                       au8DevId == NULL.
 */
en_result_t EXMC_NFC_ReadId(uint32_t u32Bank,
                                uint32_t u32IdAddr,
                                uint8_t au8DevId[],
                                uint32_t u32NumBytes,
                                uint32_t u32Timeout)
{
    uint32_t i;
    uint64_t u64Val;
    const uint32_t u32LoopWords = u32NumBytes/4UL;
    const uint32_t u32RemainBytes = u32NumBytes%4UL;
    uint32_t u32TmpId;
    uint32_t u32CapacityIndex;
    en_result_t enRet = Error;

    if ((NULL != au8DevId) && (u32NumBytes > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(u32IdAddr <= 0xFFUL);

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank) | \
                           EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR | \
                           EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR | \
                           EXMC_NFC_FLAG_ECC_CALC_COMPLETION | \
                           EXMC_NFC_FLAG_ECC_ERROR);

