RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
        u32CapacityIndex = EXMC_NFC_GetCapacityIndex();
        u64Val = (NFC_IDXR_VAL(u32Bank, 0UL, 0UL, u32CapacityIndex) & NFC_IDXR_MASK);

        /* 1. Write 0x00000000 to NFC_CMDR */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_READ_1ST);

        /* 2. Write NAND Flash address to NFC_IDXR0/1 */
        WRITE_REG32(M4_NFC->IDXR0, (uint32_t)(u64Val & 0xFFFFFFFFUL));
        WRITE_REG32(M4_NFC->IDXR1, (uint32_t)(u64Val >> 32UL));

        /* 3. Write 0x000000E0 to NFC_CMDR */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_READ_2ND);

        /* 4. Wait RB signal until high level */
        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);
        if (Ok == enRet)
        {
            /* Read Id step:
                1. Write 0x81000M90 to NFC_CMDR, M = bank number
                2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB=ID address
                3. Read NFC_DATR
                4. Write 0x000000FE to NFC_CMDR, and invalidate CE */
            WRITE_REG32(M4_NFC->CMDR, CMD_READ_ID(u32Bank));
            WRITE_REG32(M4_NFC->CMDR, CMD_READ_ID_ADDR(u32Bank, u32IdAddr));
            for (i = 0UL; i < u32LoopWords; i++)
            {
                u32TmpId = NFC_DATR_REG32(i);
                (void)memcpy (&au8DevId[i * 4UL], &u32TmpId, 4UL);
            }

            if (u32RemainBytes > 0UL)
            {
                u32TmpId = NFC_DATR_REG32(i);
                (void)memcpy (&au8DevId[i * 4UL], &u32TmpId, u32RemainBytes);
            }

            enRet = Ok;
        }

        EXMC_NFC_DeselectChip();
    }

    return enRet;
}

/**
 * @brief  Read Unique ID
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32IdAddr               The address
 * @param  [in] au32UniqueId            The id buffer
 * @param  [in] u8NumWords              The number of words to read
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  Error:                       au8DevId == NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_ReadUniqueId(uint32_t u32Bank,
                                        uint32_t u32IdAddr,
                                        uint32_t au32UniqueId[],
                                        uint8_t u8NumWords,
                                        uint32_t u32Timeout)
{
    uint8_t i;
    en_result_t enRet = Error;

    if ((NULL != au32UniqueId) && (u8NumWords > 0U))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        /* Read Id step:
            1. Write 0x81000M90 to NFC_CMDR, M = bank number
            2. Write 0x40000M00 to NFC_CMDR, M = bank number, AB=ID address
            3. Read NFC_DATR
            4. Write 0x000000FE to NFC_CMDR, and invalidate CE */
        WRITE_REG32(M4_NFC->CMDR, CMD_READ_UNIQUEID(u32Bank));
        WRITE_REG32(M4_NFC->CMDR, CMD_READ_UNIQUEID_ADDR(u32Bank));

        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);
        if (Ok == enRet)
        {
            for (i = 0U; i < u8NumWords; i++)
            {
                au32UniqueId[i] = NFC_DATR_REG32(i);
            }
        }

        EXMC_NFC_DeselectChip();
    }

    return enRet;
}

/**
 * @brief  Read parameter page
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] au32Data                The data buffer
 * @param  [in] u16NumWords             The number of words to read
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  Error:                       au8Data == NULL.
 *   @arg  ErrorTimeout:                Read timeout
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_ReadParameterPage(uint32_t u32Bank,
                                        uint32_t au32Data[],
                                        uint16_t u16NumWords,
                                        uint32_t u32Timeout)
{
    uint16_t i;
    en_result_t enRet = Error;

    if ((NULL != au32Data) && (u16NumWords > 0U))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        /* Read parameter page step:
            1. Write 0x81000MEC to NFC_CMDR, M = bank number
            2. Write 0x40000M00 to NFC_CMDR, M = bank number
            3. Read NFC_DATR
            4. Write 0x000000FE to NFC_CMDR, and invalidate CE */
        WRITE_REG32(M4_NFC->CMDR, CMD_READ_PARAMETER_PAGE(u32Bank));
        WRITE_REG32(M4_NFC->CMDR, CMD_READ_PARAMETER_PAGE_ADDR(u32Bank));

        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);
        if (Ok == enRet)
        {
            for (i = 0U; i < u16NumWords; i++)
            {
                au32Data[i] =  NFC_DATR_REG32(i);
            }
        }

        EXMC_NFC_DeselectChip();
    }

    return enRet;
}

/**
 * @brief  Set feature
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u8FeatrueAddr           The featrue address
 * @param  [in] au32Data                The data buffer
 * @param  [in] u8NumWords              The number of words to set
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  Error:                       au8Data == NULL.
 *   @arg  ErrorTimeout:                Read timeout
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_SetFeature(uint32_t u32Bank,
                                    uint8_t u8FeatrueAddr,
                                    const uint32_t au32Data[],
                                    uint8_t u8NumWords,
                                    uint32_t u32Timeout)
{
    uint8_t i;
    en_result_t enRet = Error;

    if ((NULL != au32Data) && (u8NumWords > 0U))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        WRITE_REG32(M4_NFC->CMDR, CMD_SET_FEATURE(u32Bank));
        WRITE_REG32(M4_NFC->CMDR, CMD_SET_FEATURE_ADDR(u32Bank, u8FeatrueAddr));

        for (i = 0U; i < u8NumWords; i++)
        {
            NFC_DATR_REG32(i) = au32Data[i];
        }

        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);

        EXMC_NFC_DeselectChip();
    }

    return enRet;
}

/**
 * @brief  Get feature
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u8FeatrueAddr           The featrue address
 * @param  [out] au32Data               The data buffer
 * @param  [in] u8NumWords              The number of words to get
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  Error:                       au8Data == NULL.
 *   @arg  ErrorTimeout:                Read timeout
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_GetFeature(uint32_t u32Bank,
                                    uint8_t u8FeatrueAddr,
                                    uint32_t au32Data[],
                                    uint8_t u8NumWords,
                                    uint32_t u32Timeout)
{
    uint8_t i;
    en_result_t enRet = Error;

    if ((NULL != au32Data) && (u8NumWords > 0U))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        WRITE_REG32(M4_NFC->CMDR, CMD_GET_FEATURE(u32Bank));
        WRITE_REG32(M4_NFC->CMDR, CMD_GET_FEATURE_ADDR(u32Bank, u8FeatrueAddr));

        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);
        if (Ok == enRet)
        {
            for (i = 0U; i < u8NumWords; i++)
            {
                au32Data[i] = NFC_DATR_REG32(i);
            }
        }

        EXMC_NFC_DeselectChip();
    }

    return enRet;
}

/**
 * @brief  Erase NFC device block
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32RowAddress           The row address
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Erase timeout.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_EraseBlock(uint32_t u32Bank,
                                    uint32_t u32RowAddress,
                                    uint32_t u32Timeout)
{
    en_result_t enRet;

    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));

    /* Clear Flag */
    EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

    /* Erase block step:
        1. Write 0x81000M60 to NFC_CMDR, M = bank number
        2. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the lowest bytes of Row address
        3. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the middle bytes of Row address
        4. Write 0x40000MAB to NFC_CMDR, M = bank number, AB= the highest bytes of Row address
        5. Write 0x00000MD0 to NFC_CMDR, M = bank number
        6. Wait RB signal until high level */
    WRITE_REG32(M4_NFC->CMDR, CMD_ERASE_BLOCK_1ST_CYCLE(u32Bank));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_1ST_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_2ND_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ADDR_3RD_CYCLE(u32Bank, u32RowAddress));
    WRITE_REG32(M4_NFC->CMDR, CMD_ERASE_BLOCK_2ND_CYCLE(u32Bank));

    enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                     Set, \
                                     u32Timeout);
    return enRet;
}

/**
 * @brief  NFC page read
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [out] pu8Data                The buffer for reading
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Write timeout.
 *   @arg  ErrorInvalidParameter:       The pointer au8Buf value is NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_ReadPageMeta(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    uint8_t *pu8Data,
                                    uint32_t u32NumBytes,
                                    uint32_t u32Timeout)
{
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != pu8Data) && (u32NumBytes > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDRESS_ALIGN_WORD(pu8Data));

        enRet = EXMC_NFC_Read(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                              (u32NumBytes/4UL), Disable, u32Timeout);
    }

    return enRet;
}

/**
 * @brief  NFC page write
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] pu8Data                 The buffer for writing
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Write timeout.
 *   @arg  ErrorInvalidParameter:       The pointer au8Buf value is NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_WritePageMeta(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    const uint8_t *pu8Data,
                                    uint32_t u32NumBytes,
                                    uint32_t u32Timeout)
{
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != pu8Data) && (u32NumBytes > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDRESS_ALIGN_WORD(pu8Data));

