RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
        enRet = EXMC_NFC_Write(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                                (u32NumBytes/4UL), Disable, u32Timeout);
    }

    return enRet;
}

/**
 * @brief  NFC page read by hardware ECC
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [out] pu8Data                The buffer for reading
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Write timeout.
 *   @arg  ErrorInvalidParameter:       The pointer au8Buf value is NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_ReadPageHwEcc(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    uint8_t *pu8Data,
                                    uint32_t u32NumBytes,
                                    uint32_t u32Timeout)
{
    const uint32_t u32PageSize = NFC_PAGE_SIZE;
    const uint32_t u32SpareSizeUserData = NFC_SPARE_SIZE_FOR_USER_DATA;
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != pu8Data) && (u32NumBytes > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDRESS_ALIGN_WORD(pu8Data));
        DDL_ASSERT(u32NumBytes <= (u32PageSize + u32SpareSizeUserData));

        enRet = EXMC_NFC_Read(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                                (u32NumBytes/4UL), Enable, u32Timeout);
    }

    return enRet;
}

/**
 * @brief  NFC page  write by hardware ECC
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] pu8Data                 The buffer for writing
 * @param  [in] u32NumBytes             The buffer size for bytes
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Write timeout.
 *   @arg  ErrorInvalidParameter:       The pointer au8Buf value is NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
en_result_t EXMC_NFC_WritePageHwEcc(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    const uint8_t *pu8Data,
                                    uint32_t u32NumBytes,
                                    uint32_t u32Timeout)
{
    const uint32_t u32PageSize = NFC_PAGE_SIZE;
    const uint32_t u32SpareSizeUserData = NFC_SPARE_SIZE_FOR_USER_DATA;
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != pu8Data) && (u32NumBytes > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(IS_PARAM_ALIGN_WORD(u32NumBytes));
        DDL_ASSERT(IS_ADDRESS_ALIGN_WORD((uint32_t)pu8Data));
        DDL_ASSERT(u32NumBytes <= (u32PageSize + u32SpareSizeUserData));

        enRet = EXMC_NFC_Write(u32Bank, u32Page, 0UL, (uint32_t *)((uint32_t)pu8Data), \
                                (u32NumBytes/4UL), Enable, u32Timeout);
    }

    return enRet;
}

/**
 * @}
 */

/**
 * @defgroup EXMC_NFC_Local_Functions NAND Flash Controller Local Functions
 * @{
 */

/**
 * @brief  NFC read operation
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] u32Col                  The column address
 * @param  [out] au32Data               The buffer for reading
 * @param  [in] u32NumWords             The buffer size for words
 * @param  [in] enEccState              Disable/enable ECC function
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Write timeout.
 *   @arg  ErrorInvalidParameter:       The pointer au8Buf value is NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
static en_result_t EXMC_NFC_Read(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    uint32_t u32Col,
                                    uint32_t au32Data[],
                                    uint32_t u32NumWords,
                                    en_functional_state_t enEccState,
                                    uint32_t u32Timeout)
{
    uint32_t i;
    uint64_t u64Val;
    en_result_t enRet = ErrorInvalidParameter;
    const uint32_t u32CapacityIndex = EXMC_NFC_GetCapacityIndex();

    if ((NULL != au32Data) && (u32NumWords > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(IS_EXMC_NFC_PAGE(u32Page, u32CapacityIndex));
        DDL_ASSERT(IS_EXMC_NFC_COLUMN(u32Col));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enEccState));

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank) | \
                           EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR | \
                           EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR | \
                           EXMC_NFC_FLAG_ECC_CALC_COMPLETION | \
                           EXMC_NFC_FLAG_ECC_ERROR);

        if (Enable == enEccState)
        {
            EXMC_NFC_EccCmd(Enable);
        }
        else
        {
            EXMC_NFC_EccCmd(Disable);
        }

        u64Val = (NFC_IDXR_VAL(u32Bank, u32Page, u32Col, u32CapacityIndex) & NFC_IDXR_MASK);

        /* Read page step:
            1. Write 0x00000000 to NFC_CMDR
            2. Write NAND Flash address to NFC_IDXR0/1
            3. Write 0x000000E0 to NFC_CMDR
            4. Wait RB signal until high level
            5. Read NFC_DATR
            6. Write 0x000000FE to NFC_CMDR, and invalidate CE */

        /* 1. Write 0x00000000 to NFC_CMDR */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_READ_1ST);

