RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_nfc.c
        /* 2. Write NAND Flash address to NFC_IDXR0/1 */
        WRITE_REG32(M4_NFC->IDXR0, (uint32_t)(u64Val & 0xFFFFFFFFUL));
        WRITE_REG32(M4_NFC->IDXR1, (uint32_t)(u64Val >> 32UL));

        /* 3. Write 0x000000E0 to NFC_CMDR */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_READ_2ND);

        /* 4. Wait RB signal until high level */
        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);
        if (Ok == enRet)
        {
            /* 5. Read NFC_DATR */
            for (i = 0UL; i < u32NumWords; i++)
            {
                au32Data[i] = NFC_DATR_REG32(i);
            }

            /* Clear Flag */
            EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

            if (Enable == enEccState)
            {
                /* Write 0x00000023 to NFC_CMDR */
                WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_CALCULATE_ECC);

                /* 4. Wait RB signal until high level */
                enRet = EXMC_NFC_WaitFlagUntilTo(EXMC_NFC_FLAG_ECC_CALCULATING, \
                                                 Reset, \
                                                 u32Timeout);
                EXMC_NFC_EccCmd(Disable);
            }
        }

        /* 6. Write 0x000000FE to NFC_CMDR, and invalidate CE */
        EXMC_NFC_DeselectChip();
    }

    return enRet;
}

/**
 * @brief  NFC write operation
 * @param  [in] u32Bank                 The specified bank
 *         This parameter can be one of the following values:
 *           @arg EXMC_NFC_BANK_0:      NFC device bank 0
 *           @arg EXMC_NFC_BANK_1:      NFC device bank 1
 *           @arg EXMC_NFC_BANK_2:      NFC device bank 2
 *           @arg EXMC_NFC_BANK_3:      NFC device bank 3
 *           @arg EXMC_NFC_BANK_4:      NFC device bank 4
 *           @arg EXMC_NFC_BANK_5:      NFC device bank 5
 *           @arg EXMC_NFC_BANK_6:      NFC device bank 6
 *           @arg EXMC_NFC_BANK_7:      NFC device bank 7
 * @param  [in] u32Page                 The specified page
 * @param  [in] u32Col                  The column address
 * @param  [in] au32Data                The buffer for writing
 * @param  [in] u32NumWords             The buffer size for words
 * @param  [in] enEccState              Disable/enable ECC function
 * @param  [in] u32Timeout              The operation timeout value
 * @retval An en_result_t enumeration value:
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorTimeout:                Write timeout.
 *   @arg  ErrorInvalidParameter:       The pointer au8Buf value is NULL.
 * @note Block waiting until operation complete if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
static en_result_t EXMC_NFC_Write(uint32_t u32Bank,
                                    uint32_t u32Page,
                                    uint32_t u32Col,
                                    const uint32_t au32Data[],
                                    uint32_t u32NumWords,
                                    en_functional_state_t enEccState,
                                    uint32_t u32Timeout)
{
    uint32_t i;
    uint64_t u64Val;
    en_result_t enRet = Error;
    const uint32_t u32CapacityIndex = EXMC_NFC_GetCapacityIndex();

    if ((NULL != au32Data) && (u32NumWords > 0UL))
    {
        /* Check parameters */
        DDL_ASSERT(IS_EXMC_NFC_BANK_NUM(u32Bank));
        DDL_ASSERT(IS_EXMC_NFC_PAGE(u32Page, u32CapacityIndex));
        DDL_ASSERT(IS_EXMC_NFC_COLUMN(u32Col));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enEccState));

        /* Check parameters */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank) | \
                           EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR | \
                           EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR | \
                           EXMC_NFC_FLAG_ECC_CALC_COMPLETION | \
                           EXMC_NFC_FLAG_ECC_ERROR);

        /* Clear Flag */
        EXMC_NFC_ClearStatus(NFC_FLAG_RB_BANKx_MASK(u32Bank));

        if (Enable == enEccState)
        {
            EXMC_NFC_EccCmd(Enable);
        }
        else
        {
            EXMC_NFC_EccCmd(Disable);
        }

        u64Val = (NFC_IDXR_VAL(u32Bank, u32Page, u32Col, u32CapacityIndex) & NFC_IDXR_MASK);

        /* Write page step:
            1. Write 0x00000080 to NFC_CMDR
            2. Write NAND Flash address to NFC_IDXR0/1
            3. Write NFC_DATR
            4. Write 0x00000010 to NFC_CMDR
            5. Wait RB signal until high level
            6. Write 0x000000FE to NFC_CMDR, and invalidate CE */

        /* 1. Write 0x00000080 to NFC_CMDR */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_PAGE_PROGRAM_1ST);

        /* 2. Write NAND Flash address to NFC_IDXR0/1 */
        WRITE_REG32(M4_NFC->IDXR0, (uint32_t)(u64Val & 0xFFFFFFFFUL));
        WRITE_REG32(M4_NFC->IDXR1, (uint32_t)(u64Val >> 32UL));

        /* 3. Write NFC_DATR */
        for (i = 0UL; i < u32NumWords; i++)
        {
            NFC_DATR_REG32(i) = au32Data[i];
        }

        /* 4. Write 0x00000010 to NFC_CMDR */
        WRITE_REG32(M4_NFC->CMDR, EXMC_NFC_CMD_PAGE_PROGRAM_2ND);

        /* 5. Wait RB signal until high level */
        enRet = EXMC_NFC_WaitFlagUntilTo(NFC_FLAG_RB_BANKx_MASK(u32Bank), \
                                         Set, \
                                         u32Timeout);

        /* Write 0x000000FE to NFC_CMDR, and invalidate CE */
        EXMC_NFC_DeselectChip();

        if (Enable == enEccState)
        {
            EXMC_NFC_EccCmd(Disable);
        }
    }

    return enRet;
}

/**
 * @brief  Get capacity size.
 * @param  None
 * @retval Capacity index
 *   @arg NFC_CAPACITY_INDEX_512MBIT: NFC device capacity 512MBit
 *   @arg NFC_CAPACITY_INDEX_1GBIT: NFC device capacity 1GBit
 *   @arg NFC_CAPACITY_INDEX_2GBIT: NFC device capacity 2GBit
 *   @arg NFC_CAPACITY_INDEX_4GBIT: NFC device capacity 4GBit
 *   @arg NFC_CAPACITY_INDEX_8GBIT: NFC device capacity 8GBit
 *   @arg NFC_CAPACITY_INDEX_16GBIT: NFC device capacity 16GBit
 *   @arg NFC_CAPACITY_INDEX_32GBIT: NFC device capacity 32GBit
 *   @arg NFC_CAPACITY_INDEX_64GBIT: NFC device capacity 64GBit
 */
static uint32_t EXMC_NFC_GetCapacityIndex(void)
{
    uint32_t u32Index;
    const uint32_t u32BacrSize = READ_REG32_BIT(M4_NFC->BACR, NFC_BACR_SIZE);

    switch (u32BacrSize)
    {
        case EXMC_NFC_BANK_CAPACITY_512MBIT:
            u32Index = NFC_CAPACITY_INDEX_512MBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_1GBIT:
            u32Index = NFC_CAPACITY_INDEX_1GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_2GBIT:
            u32Index = NFC_CAPACITY_INDEX_2GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_4GBIT:
            u32Index = NFC_CAPACITY_INDEX_4GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_8GBIT:
            u32Index = NFC_CAPACITY_INDEX_8GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_16GBIT:
            u32Index = NFC_CAPACITY_INDEX_16GBIT;
            break;
        case EXMC_NFC_BANK_CAPACITY_32GBIT:
            u32Index = NFC_CAPACITY_INDEX_32GBIT;
            break;
        default:
            u32Index = NFC_CAPACITY_INDEX_64GBIT;
            break;
    }

    return u32Index;
}

/**
 * @brief  Wait the specified flag with timeout.
 * @param  [in] u32Flag                 The specified flag
 *   @arg EXMC_NFC_FLAG_ECC_UNCORRECTABLE_ERROR: ECC uncorrectable error
 *   @arg EXMC_NFC_FLAG_ECC_CORRECTABLE_ERROR: ECC correctable error
 *   @arg EXMC_NFC_FLAG_ECC_CALC_COMPLETION: Calculating ECC completely
 *   @arg EXMC_NFC_FLAG_ECC_ERROR: ECC error
 *   @arg EXMC_NFC_FLAG_RB_BANK0: NFC device bank 0 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK1: NFC device bank 1 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK2: NFC device bank 2 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK3: NFC device bank 3 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK4: NFC device bank 4 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK5: NFC device bank 5 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK6: NFC device bank 6 busy flag
 *   @arg EXMC_NFC_FLAG_RB_BANK7: NFC device bank 7 busy flag
 * @param  enStatus                     The waiting flag status (SET or RESET).
 * @param  u32Timeout                   Timeout duration
 * @retval An en_result_t enumeration value:
 *   @arg  Ok: Flag is right
 *   @arg  ErrorTimeout: Wait timeout
 * @note Block checking flag if u32Timeout value is EXMC_NFC_MAX_TIMEOUT
 */
static en_result_t EXMC_NFC_WaitFlagUntilTo(uint32_t u32Flag,
                                                    en_flag_status_t enStatus,
                                                    uint32_t u32Timeout)
{
    en_result_t enRet = Ok;
    __IO uint32_t u32To = 0UL;

    /* Check parameters */
    DDL_ASSERT(IS_EXMC_NFC_FLAG(u32Flag));

    while (EXMC_NFC_GetStatus(u32Flag) != enStatus)
    {
        /* Block checking flag if timeout value is EXMC_NFC_MAX_TIMEOUT */
        if ((u32To++ > u32Timeout) && (u32Timeout < EXMC_NFC_MAX_TIMEOUT))
        {
            enRet = ErrorTimeout;
            break;
        }
    }

    return enRet;
}

/**
 * @}
 */

#endif /* DDL_NFC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
